{
    "abstract": {
        "cns": [
            "这是一款适合所有用户的非常高效的绘画工具，快速打开，易学易用。虽然采用了简约的设计手法但是软件仍然可以提供丰富的功能：",
            "1、现已支持钢笔、记号笔、铅笔、中性笔、荧光笔、干水彩笔、湿水彩笔、蜡笔、刷子、毛笔10种画笔，后续还会不断的扩充画笔类型",
            "2、提供完整的调色盘，HSV色彩空间，并支持Alpha通道调整",
            "3、支持细腻的橡皮擦并可以实时对笔画进行重做和撤销",
            "4、可以直接导入图片到画布前景或者背景，进行再次编辑和绘制",
            "5、支持作品保存和分享",
            "6、提供绘图遮挡板，可以直接把手支撑在屏幕进行绘制",
            "7、支持灵活快速的手势交互操作，方便绘画过程中的颜色选择和画笔切换",
            "",
            "**高级功能**",
            "1、画笔笔尖大小随意调控，开启更加灵活的绘制模式",
            "2、随时随地唤起颜色拾色器，快速选择需要的颜色",
            "3、一把设计简约的尺子，可能会是你的画图好伴侣",
            "4、强大的分层绘制和保存模式，绘制复杂的作品成为可能",
            "5、一支神器的水彩笔，可以实现逼真的晕染效果",
            "6、多样的图层混色模式，可以实现更多的绘图效果",
            "7、专业的画笔自定义功能",
            "",
            "**笔迹算法**",
            "“信手涂鸦”采用了精细的笔迹采集和还原算法力求达到笔迹的真实呈现。绘画时可以更加精准快速的表达自己灵动的想法。",
            "",
            "**画布**",
            "提供透明和白色两种画布并自带暗格线，可以在绘画过程中进行标的和参考。画布还可以实时缩放，最精细的位置都可以灵活触控。",
            "",
            "简约但不简单，丰富不失灵活！"
        ],
        "ens": [
            "It is a very efficient drawing tools suitable for all users. Quickly open, easy to use. Although the use of minimalist design approach but the software still provides a wealth of features:",
            "1. Now supports pens,markers,pencils,gel pen,highlighter,dry watercolor,wet watercolor,pencil,crayon brush,brush,chinese brush and more brush types are comming on.",
            "2. Provide a complete palette, HSV color space, and support for Alpha channel adjustment",
            "3. Support delicate eraser strokes in real time and can be revoked and redo",
            "4.You can directly import pictures into canvas foreground or the background, edit and draw again",
            "5. Support save and share work",
            "6. Provide shelter drawing board, you can draw with your finger and keep your hand on the screen",
            "7. Supports flexible and rapid gesture interaction to facilitate the process of painting brush and color selection switch",
            "",
            "**Pro Mode**",
            "1.Random brush tip size regulation,more open and flexible drawing mode",
            "2.Evoke the color picker anytime and anywhere,quickly select desired color",
            "3.One ruler designed simplely,may be drawing good companion",
            "4.Powerful layered drawing mode to draw complex works possible",
            "5.One magic wet watercolour brush",
            "6.Various layer blending mode, you can achieve more graphics effects",
            "7.Professional brush customization",
            "",
            "**Handwriting algorithm**",
            "\"Freehand\" with a fine handwriting algorithms to achieve the real show. Can be more accurate quick to express their ideas when painting.",
            "",
            "**Canvas**",
            "Canvas(White & Transparent) carrying guides, and can be a reference in the painting process. Canvas can also be real-time zoom.",
            "",
            "Simple but not simple, yet rich and flexible!"
        ],
        "previews":[
            "/api/static/images/knbrush/previews/preview0.jpg",
            "/api/static/images/knbrush/previews/preview1.jpg",
            "/api/static/images/knbrush/previews/preview2.jpg",
            "/api/static/images/knbrush/previews/preview3.jpg",
            "/api/static/images/knbrush/previews/preview4.jpg"
        ],
        "works": [
            "/api/static/images/knbrush/works/works0.jpg",
            "/api/static/images/knbrush/works/works1.jpg",
            "/api/static/images/knbrush/works/works2.jpg"
        ]
    }
}